app/views/classrooms/show.html.haml

			%tr
				%td= member.user.first_name
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]