app/controllers/classrooms_controller.rb

	def index
		@class_rooms = @current_user.classrooms
		if @class_rooms && @class_rooms.size>0
---
SELECT "classrooms".* FROM "classrooms" INNER JOIN "classregistrations" ON "classrooms"."id" = "classregistrations"."classroom_id" WHERE "classregistrations"."user_id" = 2

	def show
		@classroom = @current_user.classrooms.find_by_id params[:id]
		if !@classroom
			flash[:msg] = "No such class"
			redirect_to :back and return
		end

		@classregistration = @current_user.classregistrations.find_by_classroom_id @classroom
---
SELECT "classrooms".* FROM "classrooms" INNER JOIN "classregistrations" ON "classrooms"."id" = "classregistrations"."classroom_id" WHERE "classregistrations"."user_id" = 2 AND "classrooms"."id" = 1 LIMIT 1
SELECT "classregistrations".* FROM "classregistrations" WHERE "classregistrations"."user_id" = 2 AND "classregistrations"."classroom_id" = 1 LIMIT 1

  def edit
    @classroom = @current_user.classrooms.find_by_id params[:id]
    if !@classroom
      flash[:msg] = "No such classroom exists"
    else
      flash[:msg] = "Editing for approval "+params[:id]
      @current_user = User.find params[:param2]
      if @current_user
        @classregistration = @current_user.classregistrations.find_by_classroom_id @classroom
        @classregistration.classregistration_type = Classregistration.student
        @classregistration.save!
---
SELECT "classrooms".* FROM "classrooms" INNER JOIN "classregistrations" ON "classrooms"."id" = "classregistrations"."classroom_id" WHERE "classregistrations"."user_id" = 1 AND "classrooms"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "classregistrations".* FROM "classregistrations" WHERE "classregistrations"."user_id" = 2 AND "classregistrations"."classroom_id" = 1 LIMIT 1
UPDATE "classregistrations" SET "classregistration_type" = 1 WHERE "classregistrations"."id" = 2