app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
	def index
		user = User.find session[:user] if session[:user]

SELECT "users".* FROM "users" WHERE "users"."email" = 'sakethrpotturi@yahoo.com' LIMIT 1
---
	def create
		@id = params[:session][:id]
		@user = User.find_by_email(@id)