app/controllers/virtueentries_controller.rb

	def index
    @classregistration = Classregistration.find_by_user_id_and_classroom_id @current_user, @classroom
		if @classregistration.classregistration_type == Classregistration.student
      @entries=@classregistration.virtueentries.order(:date, :v_id)
---
SELECT "classregistrations".* FROM "classregistrations" WHERE "classregistrations"."user_id" = 2 AND "classregistrations"."classroom_id" = 1 LIMIT 1
SELECT "virtueentries".* FROM "virtueentries" WHERE "virtueentries"."classregistration_id" = 2 ORDER BY date, v_id

	def editall
#    flash[:notice] = "inside editall
    @date = params[:date].to_date
    if Date.today>= @date && @date>=@classroom.startdate
      week = (((params[:date].to_date)-@classroom.startdate).to_i)/7 + 1
      @entries = @classregistration.virtueentries.find_all_by_date @date
---
SELECT "virtueentries".* FROM "virtueentries" WHERE "virtueentries"."classregistration_id" = 2 AND "virtueentries"."date" = '2014-12-10'